nateihle/AmazonHarmonyIntegration/harmony/v2_06/third_party/rtos/embOS/arch/PIC32MX/RTOS.h
/*********************************************************************
*                SEGGER Microcontroller GmbH & Co. KG                *
*                        The Embedded Experts                        *
**********************************************************************
*                                                                    *
*       (c) 1995 - 2015 SEGGER Microcontroller GmbH & Co. KG         *
*                                                                    *
*     Internet: segger.com   Support: support_embos@segger.com       *
*                                                                    *
**********************************************************************
*                                                                    *
*       embOS * Real time operating system for microcontrollers      *
*                                                                    *
*                                                                    *
*       Please note:                                                 *
*                                                                    *
*       Knowledge of this file may under no circumstances            *
*       be used to write a similar product or a real-time            *
*       operating system for in-house use.                           *
*                                                                    *
*       Thank you for your fairness !                                *
*                                                                    *
**********************************************************************
*                                                                    *
*       OS version: 4.12b                                            *
*                                                                    *
**********************************************************************

----------------------------------------------------------------------
File    : RTOS.h
Purpose : Include file for the OS,
          to be included in every C-module accessing OS-routines

NOTE    : NONE OF THE DEFINITIONS IN THIS FILE MAY BE MODIFIED
          as long as embOS libraries are used.
          Any modification, direct or indirect, may cause malfunction.
          Modifications can only be done when the libraries are
          recompiled or the embOS sources are used in the project.
          
--------  END-OF-HEADER  ---------------------------------------------
*/

#ifndef RTOS_H_INCLUDED        /* Avoid multiple inclusion          */
#define RTOS_H_INCLUDED


/*********************************************************************
*
*     Includes
*/
#include <string.h>        /* memset and friends */
#ifdef DEBUG
  #undef DEBUG
  #include <xc.h>            /* XC32 intrinsic functions */
  #define DEBUG 1
#else
  #undef DEBUG
  #include <xc.h>            /* XC32 intrinsic functions */
#endif

/*********************************************************************
*
*     Chip specifics for PIC32 cores and Microchip XC32 compiler
*
**********************************************************************
*/

/*********************************************************************
*
*       Configuration
*/
#define OS_PORT_REVISION          (0u)
#define OS_PTR_OP_IS_ATOMIC       (1)
#define OS_U32_OP_IS_ATOMIC       (1)
#define OS_GetTime()              (OS_Time)
#define OS_GetTime32()            (OS_Time)
#define OS_SIZEOF_INT             (4)                 // Size of integer in bytes 
#define OS_I32                    int
#define OS_I64                    long long
#define OS_BIG_ENDIAN             (0)                 // 0 => little endian       
#define OS_SUPPORT_SYSSTACK_INFO  (1)
#define OS_SUPPORT_INTSTACK_INFO  (0)
#define OS_STACKFILL_CHAR         (0xcd)  
#define OS_SP_ADJUST              (0)
#define OS_SUPPORT_OS_ALLOC       (1)  
#define OS_EnterIntStack()                            // Int stack switching using embOS is not needed with MIPS 
#define OS_LeaveIntStack()
#define VALUE_2PTR                (OS_U32)            // Avoid GCC compiler warning 

/*****  Core specific configuration *********************************/
#define OS_SWITCH_FROM_INT_MODIFIES_STACK   (1)
#define OS_INTERRUPTS_ARE_NESTABLE_ON_ENTRY (0)
#define OS_SCHEDULER_ACTIVATED_BY_EXCEPTION (0)
#define OS_SUPPORT_INT_PRIORITY             (1)       

/*****  End of configuration settings *******************************/
#define OS_DI()  OS_DisableInterrupts();
#define OS_EI()  OS_EnableInterrupts();

#define OS_IPL_EI_DEFAULT (0 << 10)
#define OS_IPL_DI_DEFAULT (5 << 10)

#define OS_SUPPORT_CALL_ISR   0

#define OS_ENABLE_INTS_SAVE_IPL() { \
  OS_U32 Flag;                      \
  {                                 \
  Flag = OS_Ipl_EI;                 \
  OS_Ipl_EI = OS_GetIpl();          \
  OS_EI(); { 

#define OS_RESTORE_IPL()            \
  OS_Ipl_EI = Flag;                 \
}}}

#define OS_U32 unsigned
/*********************************************************************
*
*       OS_REGS
*
*  Register structure on stack. Not required by application, just a debugging help.
*/
typedef struct {
  OS_U32 s0;
  OS_U32 s1;
  OS_U32 s2;
  OS_U32 s3;
  OS_U32 s4;
  OS_U32 s5;
  OS_U32 s6;
  OS_U32 s7;
  OS_U32 fp; 
  OS_U32 Counters;
  OS_U32 PC;
} OS_REGS_BASE;

typedef struct {
  OS_REGS_BASE Base;
} OS_REGS;

/*********************************************************************
*
*       Port specific (non OS generic) functions
*/
#ifdef __cplusplus
  extern "C" {
#endif

void         OS_MIPS_SetCompare  (unsigned int value);
void         OS_MIPS_SetCount    (unsigned int value);
void         OS_MIPS_SetStatus   (unsigned int value);
void         OS_MIPS_SetCause    (unsigned int value);
void         OS_MIPS_SetIntCtl   (unsigned int value);
unsigned int OS_MIPS_GetCompare  (void);
unsigned int OS_MIPS_GetCount    (void);
unsigned int OS_MIPS_GetCause    (void);
unsigned int OS_MIPS_GetStatus   (void);
void         OS_EnableInterrupts (void);
void         OS_DisableInterrupts(void);
int          OS_GetIpl           (void);

