nateihle/AmazonHarmonyIntegration/harmony/v2_06/third_party/rtos/embOS/arch/PIC32MX/RTOS.h
/* not matching routine calls or macro usage */
#define OS_ERR_UNUSE_BEFORE_USE               (150)
#define OS_ERR_LEAVEREGION_BEFORE_ENTERREGION (151)
#define OS_ERR_LEAVEINT                       (152)
#define OS_ERR_DICNT                          (153)
#define OS_ERR_INTERRUPT_DISABLED             (154)
#define OS_ERR_TASK_ENDS_WITHOUT_TERMINATE    (155)
#define OS_ERR_RESOURCE_OWNER                 (156)
#define OS_ERR_REGIONCNT                      (157)

#define OS_ERR_ILLEGAL_IN_ISR                 (160)  /* Not a legal system call during interrupt */
#define OS_ERR_ILLEGAL_IN_TIMER               (161)  /* Not a legal system call during timer */
#define OS_ERR_ILLEGAL_OUT_ISR                (162)  /* Not a legal system call outside interrupt */
#define OS_ERR_NOT_IN_ISR                     (163)  /* OS_EnterInterrupt() has been called, but CPU is not in ISR state */
#define OS_ERR_IN_ISR                         (164)  /* OS_EnterInterrupt() has not been called, but CPU is in ISR state */

#define OS_ERR_INIT_NOT_CALLED                (165)  /* OS_InitKern() was not called */

#define OS_ERR_CPU_STATE_ISR_ILLEGAL          (166)
#define OS_ERR_CPU_STATE_ILLEGAL              (167)
#define OS_ERR_CPU_STATE_UNKNOWN              (168)

/* Double used data structures */
#define OS_ERR_2USE_TASK                      (170)
#define OS_ERR_2USE_TIMER                     (171)
#define OS_ERR_2USE_MAILBOX                   (172)
#define OS_ERR_2USE_BSEMA                     (173)
#define OS_ERR_2USE_CSEMA                     (174)
#define OS_ERR_2USE_RSEMA                     (175)
#define OS_ERR_2USE_MEMF                      (176)

/* Communication errors (OSCOM) */
#define OS_ERR_NESTED_RX_INT                  (180)

/* Fixed block memory pool  */
#define OS_ERR_MEMF_INV                       (190)
#define OS_ERR_MEMF_INV_PTR                   (191)
#define OS_ERR_MEMF_PTR_FREE                  (192)
#define OS_ERR_MEMF_RELEASE                   (193)
#define OS_ERR_MEMF_POOLADDR                  (194)
#define OS_ERR_MEMF_BLOCKSIZE                 (195)

/* Task suspend / resume errors */
#define OS_ERR_SUSPEND_TOO_OFTEN              (200)
#define OS_ERR_RESUME_BEFORE_SUSPEND          (201)

/* Other task related errors */
#define OS_ERR_TASK_PRIORITY                  (202)
#define OS_ERR_TASK_PRIORITY_INVALID          (203)

/* Event object */
#define OS_ERR_EVENT_INVALID                  (210)
#define OS_ERR_EVENT_DELETE                   (212)

/* Waitlist (checked build) */
#define OS_ERR_WAITLIST_RING                  (220)
#define OS_ERR_WAITLIST_PREV                  (221)
#define OS_ERR_WAITLIST_NEXT                  (222)

/* Tick Hook */
#define OS_ERR_TICKHOOK_INVALID               (223)
#define OS_ERR_TICKHOOK_FUNC_INVALID          (224)

/* Other potential problems discovered in checked build */
#define OS_ERR_NOT_IN_REGION                  (225)

/* Cache related */
#define OS_ERR_NON_ALIGNED_INVALIDATE         (230)

/* System timer config related */
#define OS_ERR_NON_TIMERCYCLES_FUNC           (235)
#define OS_ERR_NON_TIMERINTPENDING_FUNC       (236)

/* OS special build, or internal */
#define OS_ERR_TRIAL_LIMIT                    (254)

/*********************************************************************
*
*       Trace identifier
*
**********************************************************************

Identifier from 0 to 99 are reserved for the OS.
Identifier from 100 to 127 are reserved for the application.
Identifier from 128 to 5000 are reserved for Percepio Trace.
Even when not all of those are currently used,
they may be defined in the future

*/

#define OS_TRACE_API_OFFSET              32  // API IDs start at this offset. This has been done to maintain compatibility of API-Ids with embOSView, which uses the reserved area of SYSVIEW (0..31)


#define OS_TRACE_ID_DEACTIVATE      (1u)
#define OS_TRACE_ID_ACTIVATE        (2u)
#define OS_TRACE_ID_TIMERCALLBACK   (3u)

/* Task group */
#define OS_TRACE_ID_DELAY           (10u)
#define OS_TRACE_ID_DELAYUNTIL      (11u)
#define OS_TRACE_ID_SETPRIORITY     (12u)
#define OS_TRACE_ID_WAKETASK        (13u)
#define OS_TRACE_ID_CREATETASK      (14u)
#define OS_TRACE_ID_TERMINATETASK   (15u)
#define OS_TRACE_ID_SUSPENDTASK     (16u)
#define OS_TRACE_ID_RESUMETASK      (17u)
#define OS_TRACE_ID_CREATETASK_EX   (18u)
#define OS_TRACE_ID_YIELD           (19u)

/* Event group */
#define OS_TRACE_ID_WAITEVENT       (20u)
#define OS_TRACE_ID_WAITEVENT_TIMED (21u)
#define OS_TRACE_ID_SIGNALEVENT     (22u)
#define OS_TRACE_ID_CLEAREVENTS     (23u)

/* Mailbox group  */
#define OS_TRACE_ID_CREATEMB        (30u)
#define OS_TRACE_ID_CLEARMB         (31u)
#define OS_TRACE_ID_DELETEMB        (32u)
#define OS_TRACE_ID_PUTMAIL         (33u)
#define OS_TRACE_ID_GETMAIL         (34u)
#define OS_TRACE_ID_PUTMAILCOND     (35u)
#define OS_TRACE_ID_GETMAILCOND     (36u)
#define OS_TRACE_ID_PUTMAIL_TIMED   (37u)
#define OS_TRACE_ID_GETMAIL_TIMED   (38u)
#define OS_TRACE_ID_WAITMAIL        (39u)

#define OS_TRACE_ID_PUTMAIL1        (40u)
#define OS_TRACE_ID_GETMAIL1        (41u)
#define OS_TRACE_ID_PUTMAILCOND1    (42u)
#define OS_TRACE_ID_GETMAILCOND1    (43u)
#define OS_TRACE_ID_PUTMAIL_TIMED1  (44u)
#define OS_TRACE_ID_GETMAIL_TIMED1  (45u)

#define OS_TRACE_ID_PUTMAIL_F       (46u)
#define OS_TRACE_ID_PUTMAIL_F1      (47u)
#define OS_TRACE_ID_PUTMAIL_FCOND   (48u)
#define OS_TRACE_ID_PUTMAIL_FCOND1  (49u)

/* Resource group */
#define OS_TRACE_ID_CREATERSEMA     (50u)
#define OS_TRACE_ID_USE             (51u)
#define OS_TRACE_ID_UNUSE           (52u)
#define OS_TRACE_ID_REQUEST         (53u)
#define OS_TRACE_ID_GETSEMAVALUE    (54u)
#define OS_TRACE_ID_DELETE_RSEMA    (55u)

#define OS_TRACE_ID_WAITMAIL_TIMED  (59u)

/* Counting Semaphore group */
#define OS_TRACE_ID_CREATECSEMA     (60u)
#define OS_TRACE_ID_DELETECSEMA     (61u)
#define OS_TRACE_ID_SIGNALCSEMA     (62u)
#define OS_TRACE_ID_WAITCSEMA       (63u)
#define OS_TRACE_ID_WAITCSEMATIMED  (64u)
#define OS_TRACE_ID_SIGNALCSEMA_MAX (65u)
#define OS_TRACE_ID_SET_CSEMAVALUE  (66u)
#define OS_TRACE_ID_CSEMAREQUEST    (67u)

/* Timer group    */
#define OS_TRACE_ID_CREATETIMER     (70u)
#define OS_TRACE_ID_DELETETIMER     (71u)
#define OS_TRACE_ID_STARTTIMER      (72u)
#define OS_TRACE_ID_STOPTIMER       (73u)
#define OS_TRACE_ID_RETRIGGERTIMER  (74u)
#define OS_TRACE_ID_SETTIMERPERIOD  (75u)
#define OS_TRACE_ID_CREATETIMER_EX  (76u)

/* Heap type memory management  */
#define OS_TRACE_ID_MALLOC          (80u)
#define OS_TRACE_ID_FREE            (81u)
#define OS_TRACE_ID_REALLOC         (82u)

/* Fixed block type memory management  */
#define OS_TRACE_ID_MEMF_CREATE     (90u)
#define OS_TRACE_ID_MEMF_DELETE     (91u)
#define OS_TRACE_ID_MEMF_ALLOC      (92u)

/* Additional trace identifier */
#define OS_TRACE_ID_PREEMPT             (128u)
#define OS_TRACE_ID_TASK_READY          (129u)
#define OS_TRACE_ID_TICK                (130u)
#define OS_TRACE_ID_DELAYUS             (131u)
#define OS_TRACE_ID_SUSPENDALL          (132u)
#define OS_TRACE_ID_RESUMEALL           (133u)
#define OS_TRACE_ID_WAITSEVENT          (134u)
#define OS_TRACE_ID_WAITSEVENT_TIMED    (135u)
#define OS_TRACE_ID_EVENTPULSE          (136u)
#define OS_TRACE_ID_EVENTRESET          (137u)
#define OS_TRACE_ID_EVENTSET            (138u)
#define OS_TRACE_ID_EVENTWAIT           (139u)
#define OS_TRACE_ID_EVENTWAIT_TIMED     (140u)
#define OS_TRACE_ID_CREATE_EVENT        (141u)
#define OS_TRACE_ID_CREATE_EVENT_EX     (142u)
#define OS_TRACE_ID_DELETE_EVENT        (143u)
#define OS_TRACE_ID_PEEKMAIL            (144u)
#define OS_TRACE_ID_CREATE_Q            (145u)
#define OS_TRACE_ID_DELETE_Q            (146u)
#define OS_TRACE_ID_Q_CLEAR             (147u)
#define OS_TRACE_ID_Q_PUT               (148u)
#define OS_TRACE_ID_Q_PUT_COND          (149u)
#define OS_TRACE_ID_Q_PUT_TIMED         (150u)
#define OS_TRACE_ID_Q_GET               (151u)
#define OS_TRACE_ID_Q_GET_COND          (152u)
#define OS_TRACE_ID_Q_GET_TIMED         (153u)
#define OS_TRACE_ID_Q_PEEK              (154u)
#define OS_TRACE_ID_Q_PURGE             (155u)
#define OS_TRACE_ID_MEMF_ALLOCTIMED     (156u)
#define OS_TRACE_ID_MEMF_FREE           (157u)
#define OS_TRACE_ID_MEMF_RELEASE        (158u)
#define OS_TRACE_ID_MEMF_REQUEST        (159u)
#define OS_TRACE_ID_TS_CFG              (160u)
#define OS_TRACE_ID_START_TRACE         (161u)
#define OS_TRACE_ID_OBJECTNAME          (162u)
#define OS_TRACE_ID_USE_TIMED           (163u)
#define OS_TRACE_ID_DEFINE_ISR          (164u)
#define OS_TRACE_ID_ISR_BEGIN           (165u)
#define OS_TRACE_ID_ISR_RESUME          (166u)
#define OS_TRACE_ID_SETTASKNAME         (167u)
#define OS_TRACE_ID_ADJUSTTIME          (168u)
#define OS_TRACE_ID_EVENTGET            (169u)
#define OS_TRACE_ID_GETRESETMODE        (170u)
#define OS_TRACE_ID_SETRESETMODE        (171u)
#define OS_TRACE_ID_GETNUMIDLETICKS     (172u)
#define OS_TRACE_ID_GETNUMTASKS         (173u)
#define OS_TRACE_ID_GETTASKPRIO         (174u)
#define OS_TRACE_ID_GETSUSPENDCNT       (175u)
#define OS_TRACE_ID_MAIL_GETPTR         (176u)
#define OS_TRACE_ID_POWER_USAGEINC      (177u)
#define OS_TRACE_ID_POWER_USAGEDEC      (178u)
#define OS_TRACE_ID_POWER_GETMASK       (179u)
#define OS_TRACE_ID_SETINIT_SUSPENDCNT  (180u)
#define OS_TRACE_ID_GETTIME_US          (181u)
#define OS_TRACE_ID_GETTIME_US64        (182u)
#define OS_TRACE_ID_TICK_HANDLE_EX      (183u)
#define OS_TRACE_ID_TICK_HANDLE_NOHOOK  (184u)
#define OS_TRACE_ID_TICK_ADDHOOK        (185u)
#define OS_TRACE_ID_TICK_REMOVEHOOK     (186u)
#define OS_TRACE_ID_START_TICKLESS      (187u)
#define OS_TRACE_ID_STOP_TICKLESS       (188u)
#define OS_TRACE_ID_GETCSEMA_VALUE      (189u)
#define OS_TRACE_ID_GETEVENTS_OCCURRED  (190u)
#define OS_TRACE_ID_ISTASK              (191u)
#define OS_TRACE_ID_Q_GETMSGCNT         (192u)
#define OS_TRACE_ID_Q_GETMSGSIZE        (193u)
#define OS_TRACE_ID_Q_ISUNUSE           (194u)
#define OS_TRACE_ID_SET_TIMESLICE       (195u)
#define OS_TRACE_ID_GET_RESOURCEOWNER   (196u)
#define OS_TRACE_ID_GET_TIMERPERIOD     (197u)
#define OS_TRACE_ID_GET_TIMERSTATUS     (198u)
#define OS_TRACE_ID_GET_TIMERVALUE      (199u)
#define OS_TRACE_ID_TIMING_START        (200u)
#define OS_TRACE_ID_TIMING_END          (201u)
#define OS_TRACE_ID_TIMING_GETUS        (202u)


