nateihle/AmazonHarmonyIntegration/harmony/v2_06/third_party/rtos/embOS/arch/PIC32MX/RTOS.h
/* Events 1000-1999 corresponds to "blocking on blocking call" on events 0-999 */
#define OS_TRACE_ID_RFB              (1000u)

/* Events 2000-2999 corresponds to "timeout on blocking call" on events 0-999 */
#define OS_TRACE_ID_TIMEOUT          (2000u)

#define OS_TRACE_ID_USEREVENT        (3000u)

#define OS_TRACE_ID_IFE              (4000u)
#define OS_TRACE_ID_IFE_NEXT         (4001u)

#if OS_PROFILE
  #define TRACE_RECORD_TASK_INFO(pTask)                               if (OS_Global.pTrace) {OS_Global.pTrace->pfRecordTaskInfo((pTask)); }
  #define TRACE_RECORD_API_VOID(Id)                                   if (OS_Global.pTrace) {OS_Global.pTrace->pfRecordVoid ((Id) + OS_TRACE_API_OFFSET); }
  #define TRACE_RECORD_API_U32(Id, Para0)                             if (OS_Global.pTrace) {OS_Global.pTrace->pfRecordU32  ((Id) + OS_TRACE_API_OFFSET, (OS_U32)(Para0)); }
  #define TRACE_RECORD_API_PTR(Id, Para0)                             if (OS_Global.pTrace) {OS_Global.pTrace->pfRecordU32  ((Id) + OS_TRACE_API_OFFSET, OS_Global.pTrace->pfPtrToId((OS_U32)(Para0))); }
  #define TRACE_RECORD_API_U32X2(Id, Para0, Para1)                    if (OS_Global.pTrace) {OS_Global.pTrace->pfRecordU32x2((Id) + OS_TRACE_API_OFFSET, (OS_U32)(Para0), (OS_U32)(Para1)); }
  #define TRACE_RECORD_API_PTR_U32(Id, Para0, Para1)                  if (OS_Global.pTrace) {OS_Global.pTrace->pfRecordU32x2((Id) + OS_TRACE_API_OFFSET, OS_Global.pTrace->pfPtrToId((OS_U32)(Para0)), (OS_U32)(Para1)); }
  #define TRACE_RECORD_API_U32X3(Id, Para0, Para1, Para2)             if (OS_Global.pTrace) {OS_Global.pTrace->pfRecordU32x3((Id) + OS_TRACE_API_OFFSET, (OS_U32)(Para0), (OS_U32)(Para1), (OS_U32)(Para2)); }
  #define TRACE_RECORD_API_PTR_U32X2(Id, Para0, Para1, Para2)         if (OS_Global.pTrace) {OS_Global.pTrace->pfRecordU32x3((Id) + OS_TRACE_API_OFFSET, OS_Global.pTrace->pfPtrToId((OS_U32)(Para0)), (OS_U32)(Para1), (OS_U32)(Para2)); }
  #define TRACE_RECORD_API_U32X4(Id, Para0, Para1, Para2, Para3)      if (OS_Global.pTrace) {OS_Global.pTrace->pfRecordU32x4((Id) + OS_TRACE_API_OFFSET, (OS_U32)(Para0), (OS_U32)(Para1), (OS_U32)(Para2), (OS_U32)(Para3)); }
  #define TRACE_RECORD_API_PTR_U32X3(Id, Para0, Para1, Para2, Para3)  if (OS_Global.pTrace) {OS_Global.pTrace->pfRecordU32x4((Id) + OS_TRACE_API_OFFSET, OS_Global.pTrace->pfPtrToId((OS_U32)(Para0)), (OS_U32)(Para1), (OS_U32)(Para2), (OS_U32)(Para3)); }
  #define TRACE_ON_ISR_ENTER()                                        if (OS_Global.pTrace) {OS_Global.pTrace->pfRecordEnterISR(); }
  #define TRACE_ON_ISR_EXIT()                                         if (OS_Global.pTrace) {OS_Global.pTrace->pfRecordExitISR(); }
  #define TRACE_ON_ISR_EXIT_TO_SCHEDULER()                            if (OS_Global.pTrace) {OS_Global.pTrace->pfRecordExitISRToScheduler(); }
  #define TRACE_ON_TASK_START_EXEC(TaskId)                            if (OS_Global.pTrace) {OS_Global.pTrace->pfRecordTaskStartExec((TaskId)); }
  #define TRACE_ON_TASK_STOP_EXEC()                                   if (OS_Global.pTrace) {OS_Global.pTrace->pfRecordTaskStopExec(); }
  #define TRACE_ON_TASK_START_READY(TaskId)                           if (OS_Global.pTrace) {OS_Global.pTrace->pfRecordTaskStartReady((TaskId)); }
  #define TRACE_ON_TASK_STOP_READY(TaskId, Para1)                     if (OS_Global.pTrace) {OS_Global.pTrace->pfRecordTaskStopReady((TaskId), (Para1)); }
  #define TRACE_ON_TASK_CREATE(TaskId)                                if (OS_Global.pTrace) {OS_Global.pTrace->pfRecordTaskCreate((OS_U32)(TaskId)); }
  #define TRACE_ON_IDLE()                                             if (OS_Global.pTrace) {OS_Global.pTrace->pfRecordIdle(); }
#else
  #define TRACE_RECORD_TASK_INFO(pTask)
  #define TRACE_RECORD_API_VOID(Id)
  #define TRACE_RECORD_API_U32(Id, Para0)
  #define TRACE_RECORD_API_PTR(Id, Para0)
  #define TRACE_RECORD_API_U32X2(Id, Para0, Para1)
  #define TRACE_RECORD_API_PTR_U32(Id, Para0, Para1)
  #define TRACE_RECORD_API_U32X3(Id, Para0, Para1, Para2)
  #define TRACE_RECORD_API_PTR_U32X2(Id, Para0, Para1, Para2)
  #define TRACE_RECORD_API_U32X4(Id, Para0, Para1, Para2, Para3)
  #define TRACE_RECORD_API_PTR_U32X3(Id, Para0, Para1, Para2, Para3)
  #define TRACE_ON_ISR_ENTER()
  #define TRACE_ON_ISR_EXIT()
  #define TRACE_ON_ISR_EXIT_TO_SCHEDULER()
  #define TRACE_ON_TASK_START_EXEC(TaskId)
  #define TRACE_ON_TASK_STOP_EXEC()
  #define TRACE_ON_TASK_START_READY(TaskId)
  #define TRACE_ON_TASK_STOP_READY(TaskId, Para1)
  #define TRACE_ON_TASK_CREATE(TaskId)
  #define TRACE_ON_IDLE()
#endif

#define OS_TRACE_API_VOID(Id)                       { OS_TRACE_VOID(Id);                               \
                                                      OS_PTRACE_VOID(Id);                              \
                                                      TRACE_RECORD_API_VOID(Id);                       \
                                                    }

#define OS_TRACE_API_U32(Id, Para0)                 { OS_TRACE_DATA(Id, Para0);                         \
                                                      OS_PTRACE_DATA(Id, Para0);                        \
                                                      TRACE_RECORD_API_U32(Id, Para0);                  \
                                                    }


#define OS_TRACE_API_PTR(Id, Para0)                 { OS_TRACE_PTR(Id, Para0);                          \
                                                      OS_PTRACE_PTR(Id, Para0);                         \
                                                      TRACE_RECORD_API_PTR(Id, Para0);                  \
                                                    }

/*********************************************************************
*
*       Assertions
*
**********************************************************************

  Assertions are used to generate code in the debug version
  of the OS in order catch programming faults like
  bad pointers or uninitialized data structures
*/

#if OS_DEBUG
  #define OS_ASSERT(Exp, ErrCode)  { if (!(Exp)) {OS_Error(ErrCode); }}
#else
  #define OS_ASSERT(Exp, ErrCode)
#endif

