nateihle/AmazonHarmonyIntegration/harmony/v2_06/third_party/rtos/embOS/arch/PIC32MX/RTOS.h
  /*** Pointers ***
    Unfortunately there is no real standard on how to define/declare
    pointers properly with extended memory attributes. There are
    currently 2 different standards, which we both support.
  */

  #if OS_COMPILER_LOCATION_LEFT
    extern    OS_SADDR OS_GLOBAL     OS_Global;              /* Major OS variables, initialized in OSGlobal.c */
    OS_EXTERN OS_SADDR OS_RSEMA      * OS_pRSema;  // PRQA S 3406
    OS_EXTERN OS_SADDR OS_Q          * OS_pQHead;  // PRQA S 3406
    #if OS_LINK_MAILBOXES
      OS_EXTERN OS_SADDR OS_MAILBOX  * OS_pMailbox;  // PRQA S 3406
    #endif
    #if OS_DEBUG
      OS_EXTERN OS_SADDR OS_CSEMA    * OS_pCSema;  // PRQA S 3406
    #endif
    OS_EXTERN   OS_SADDR OS_MEMF      * OS_pMEMF;            /* linked list of all fixed size memory pools */  // PRQA S 3406 
    OS_EXTERN   OS_SADDR OS_TICK_HOOK * OS_pTickHook;        /* linked list of all tick hook functions */  // PRQA S 3406
    #if OS_SUPPORT_PTLS
      OS_EXTERN   OS_SADDR OS_TLS_PTR OS_pTLS;               /* Global pointer to thread local storage */
    #endif
  #else
    extern      OS_GLOBAL            OS_SADDR OS_Global;     /* Major OS variables, initialized in OSGlobal.c */
    OS_EXTERN   OS_RSEMA           * OS_SADDR OS_pRSema;
    OS_EXTERN   OS_Q               * OS_SADDR OS_pQHead;

    #if OS_LINK_MAILBOXES
      OS_EXTERN OS_MAILBOX         * OS_SADDR OS_pMailbox;
    #endif

    #if OS_DEBUG
      OS_EXTERN  OS_CSEMA          * OS_SADDR OS_pCSema;
    #endif
    OS_EXTERN OS_MEMF              * OS_SADDR OS_pMEMF;          /* linked list of all fixed size memory pools */
    OS_EXTERN OS_TICK_HOOK         * OS_SADDR OS_pTickHook;      /* linked list of all tick hook functions */
    #if OS_SUPPORT_PTLS
      OS_EXTERN OS_TLS_PTR           OS_SADDR OS_pTLS;           /* Global pointer to thread local storage */
    #endif
  #endif

#else   /*  OS_COMPILER_STORAGE_MODIFIER_LEFT == 0, needed for Keil 166 */
  #error "OS_COMPILER_STORAGE_MODIFIER_LEFT == 0 not supported in this version."
#endif  /*  OS_COMPILER_STORAGE_MODIFIER_LEFT  */

/***** Mark end of memory pragma area *******************************/
#if defined(__ghs_zda)
  #pragma ghs endzda
#endif

/********************************************************************/

#define OS_RegionCnt OS_Global.Counters.Cnt.Region
#define OS_DICnt     OS_Global.Counters.Cnt.DI

/*********************************************************************
*
*       OS_CREATETASK macro
*       OS_CREATETASK_EX macro
*/
#if OS_RR_SUPPORTED
  #define CTPARA_TIMESLICE ,2u
#else
  #define CTPARA_TIMESLICE
#endif

#if OS_TRACKNAME
  #define OS_CREATETASK(pTask, Name, Hook, Priority, pStack)  \
  OS_CreateTask ((pTask),                                     \
                 (Name),                                      \
                 (OS_PRIO) (Priority),                        \
                 (Hook),                                      \
                 (void OS_STACKPTR*)(pStack),                 \
                 sizeof(pStack)                               \
                 CTPARA_TIMESLICE                             \
               )  // PRQA S 3453
#else
  #define OS_CREATETASK(pTask, Name, Hook, Priority, pStack)  \
  OS_CreateTask ((pTask),                                     \
                 (OS_PRIO) (Priority),                        \
                 (Hook),                                      \
                 (void OS_STACKPTR*)(pStack),                 \
                 sizeof(pStack)                               \
                 CTPARA_TIMESLICE                             \
               )
#endif

#if OS_TRACKNAME
  #define OS_CREATETASK_EX(pTask, Name, Hook, Priority, pStack, pContext) \
  OS_CreateTaskEx  ((pTask),                                              \
                    (Name),                                               \
                    (Priority),                                           \
                    (Hook),                                               \
                    (void OS_STACKPTR*)(pStack),                          \
                    sizeof(pStack)                                        \
                    CTPARA_TIMESLICE,                                     \
                    (pContext)                                            \
               )  // PRQA S 3453
#else
  #define OS_CREATETASK_EX(pTask, Name, Hook, Priority, pStack, pContext) \
  OS_CreateTaskEx  ((pTask),                                              \
                    (Priority),                                           \
                    (Hook),                                               \
                    (void OS_STACKPTR*)(pStack),                          \
                    sizeof(pStack)                                        \
                    CTPARA_TIMESLICE,                                     \
                    (pContext)                                            \
               )
#endif

/*********************************************************************
*
*       OS_CreateTask
*       OS_CreateTaskEx
*/
#if OS_TRACKNAME
  #define OS_CREATE_TASK_PARA_NAME      OS_ROM_DATA const char* pName,
#else
  #define OS_CREATE_TASK_PARA_NAME
#endif

#if OS_RR_SUPPORTED
  #define OS_CREATE_TASK_PARA_TS   ,OS_UINT TimeSlice
#else
  #define OS_CREATE_TASK_PARA_TS
#endif

void OS_CreateTask  ( OS_TASK * pTask,
                      OS_CREATE_TASK_PARA_NAME
                      OS_PRIO Priority,
                      void (*pRoutine)(void),
                      void OS_STACKPTR *pStack,
                      OS_UINT StackSize
                      OS_CREATE_TASK_PARA_TS
        );

void OS_CreateTaskEx  ( OS_TASK * pTask,
                        OS_CREATE_TASK_PARA_NAME
                        OS_PRIO Priority,
                        void (*pRoutine)(void * pVoid),
                        void OS_STACKPTR *pStack,
                        OS_UINT StackSize
                        OS_CREATE_TASK_PARA_TS,
                        void * pContext
        );

#if OS_SUPPORT_SAVE_RESTORE_HOOK
void OS_ExtendTaskContext(const OS_EXTEND_TASK_CONTEXT * pExtendContext);
#endif

/*********************************************************************
*
*       Task related routines
*
**********************************************************************
*/
void     OS_AddOnTerminateHook       (OS_ON_TERMINATE_HOOK * pHook, OS_ON_TERMINATE_FUNC * pfUser);
void     OS_Delay                    (OS_TIME ms);            /* OSKern.c              */
void     OS_DelayUntil               (OS_TIME t);             /* OSKern.c              */
void     OS_Delayus                  (OS_U16  us);            /* OS_Delayus.c          */
OS_U8    OS_GetSuspendCnt            (OS_CONST_PTR OS_TASK* pTask);  /* OS_GetSuspendCnt.c    */
void     OS_GetState                 (OS_TASK* pTask);
OS_BOOL  OS_IsTask                   (OS_CONST_PTR OS_TASK* pTask);  /* OSIsTask.c            */
void     OS_Resume                   (OS_TASK* pTask);        /* OS_Suspend.c          */
void     OS_ResumeAllSuspendedTasks  (void);                  /* OS_ResumeAllTasks.c   */
void     OS_SetTaskName              (OS_TASK * pTask, OS_ROM_DATA const char* s);
void     OS_SetPriority              (OS_TASK* pTask, OS_PRIO Priority);   /* OSSetP.c   */
void     OS_SetInitialSuspendCnt     (OS_U8 SuspendCnt);      /* OS_SetSuspendCnt.c    */
void     OS_Suspend                  (OS_TASK* pTask);        /* OS_Suspend.c          */
void     OS_SuspendAllTasks          (void);                  /* OS_SuspendAllTasks.c  */
void     OS_TerminateTask            (OS_TASK* pTask);        /* OSTerm.c              */
void     OS_TerminateError           (void);                  /* OSTermE.c             */
void     OS_WakeTask                 (OS_TASK* pTask);        /* OSWake.c              */
void     OS_Yield                    (void);                  /* OS_Yield              */
#if OS_SUSPEND_TASK_ON_TERMINATE           /* Set task state of a terminated task to "suspended" */
  #define OS_SUSPEND_TERMINATED_TASK(pTask) ((pTask)->Stat = 0x01)  // PRQA S 3453
#else
  #define OS_SUSPEND_TERMINATED_TASK(pTask)
#endif

/*********************************************************************
*
*       Info routines (OSInfo.c)
*
**********************************************************************
*/

OS_ROM_DATA const char* OS_GetCPU(void);
OS_ROM_DATA const char* OS_GetLibMode(void);
OS_ROM_DATA const char* OS_GetModel(void);
OS_ROM_DATA const char* OS_GetLibName(void);

OS_UINT OS_GetVersion(void);
#define OS_GetType() OS_GetLibMode()

