nateihle/AmazonHarmonyIntegration/harmony/v2_06/third_party/rtos/embOS/arch/PIC32MX/RTOS.h
void   OS_COM_ClearTxActive(void);   /* OSCom2.c */

#define OS_Start()  OS_Running = 1u; OS_StartASM()

/********** Additional functions prototypes for Percepio Trace *******/
OS_U32 OS_GetPClkTimer(void);
OS_U32 OS_GetTickFreq (void);

/*********************************************************************
*
*        RTOS misc. optional
*
**********************************************************************

The routines declared below are available on some targets
only. (Because they do not make much sense on others)
*/

/* Timing routines. Their existance depends on the CPU. In general,
  8-bit CPUs require both routines, where 16-bit CPUs require one
  and 32-bit CPUs require none of these.
*/
#ifndef OS_GetTime
  OS_TIME OS_GetTime(void);
#endif
#ifndef OS_GetTime32
  #if (OS_SIZEOF_INT == 4)
    #define OS_GetTime32() (OS_Global.Time)
  #else
    OS_I32 OS_GetTime32(void);
  #endif
#endif

#ifdef OS_U64
void     OS_Config_SysTimer(const OS_SYSTIMER_CONFIG *pConfig); /* Routine for setting up values for OS_GetTime_us()   */
OS_U32   OS_GetTime_us     (void);                              /* Routine for calculating current system time in usec */
  OS_U64 OS_GetTime_us64   (void);
#endif

void OS__di(void);
void OS__ei(void);
void OS__SaveIPL(void);
void OS__RestIPL(void);
void OS_SIM_Init(void);

/* Standard tick handler which increment OS time variable by one on each interrupt */
void OS_TICK_Handle(void);       /* New version of OS_TickHandler() without Enter- Leave-Interrupt  */
void OS_TICK_HandleEx(void);     /* OS_TICK_HandleEx.c */
void OS_TICK_HandleNoHook(void); /* Alternate fster tick hanlder without tick-hook-function */
void OS_TICK_Config(unsigned FractPerInt, unsigned FractPerTick);
void OS_TICK_AddHook   (OS_TICK_HOOK* pHook, OS_TICK_HOOK_ROUTINE * pfUser);
void OS_TICK_RemoveHook(OS_CONST_PTR OS_TICK_HOOK* pHook);

/* Routines for the PC-version running in native mode (non-windows) */
void OS_SetIntFreq(OS_UINT f);
void OS_Exit(int code);
void OS_UseDos(void);
void OS_UnuseDos(void);
int  OS_GetKey(void);
int  OS_WaitKey(void);

/* Compatibility with manual */
#define OS_CREATEMB          OS_CreateMB
#define OS_GetUseCnt         OS_GetSemaValue
#define OS_WaitCSema_Timed   OS_WaitCSemaTimed
#define OS_WaitEvent_Timed   OS_WaitEventTimed
#define OS_GetEventsOccured  OS_GetEventsOccurred

/* Compatibility with pre V3.60e versions, renamed functions */
#define OS_HandleTick      OS_TICK_Handle
#define OS_HandleTickEx    OS_TICK_HandleEx
#define OS_AddTickHook     OS_TICK_AddHook
#define OS_RemoveTickHook  OS_TICK_RemoveHook

/* Compatibility with pre V3.82v versions, renamed functions */
#define OS_Terminate       OS_TerminateTask


/*********************************************************************
*
*        Debug info for thread awareness
*
**********************************************************************
*
* Field offsets required by remote debugger for thread-awareness,
* i.e. for walking the task list.
*/
struct OS_DEBUG_INFO_STRUCT
{
  /* Offsets in OS_GLOBAL struct */
  OS_U8 OS_GLOBAL_pCurrentTask_Offs;     /* Offset of pCurrentTask     */
  OS_U8 OS_GLOBAL_pTask_Offs;            /* Offset of pTask            */
  OS_U8 OS_GLOBAL_pActiveTask_Offs;      /* Offset of pActiveTask      */
  OS_U8 OS_GLOBAL_pTimer_Offs;           /* Offset of pTimer           */
  OS_U8 OS_GLOBAL_pCurrentTimer_Offs;    /* Offset of pCurrentTimer    */
  OS_U8 OS_GLOBAL_Time_Offs;             /* Offset of Time             */
  OS_U8 OS_GLOBAL_TimeSlice_Offs;        /* Offset of TimeSlice;       */
  OS_U8 OS_GLOBAL_TimeSliceAtStart_Offs; /* Offset of TimeSliceAtStart */
  /* Offsets in OS_TASK struct */
  OS_U8 OS_TASK_pNext_Offs;              /* Offset of pNext            */
  OS_U8 OS_TASK_pStack_Offs;             /* Offset of pStack           */
  OS_U8 OS_TASK_Timeout_Offs;            /* Offset of Timeout          */
  OS_U8 OS_TASK_Stat_Offs;               /* Offset of Stat             */
  OS_U8 OS_TASK_Priority_Offs;           /* Offset of Priority         */
  OS_U8 OS_TASK_Events_Offs;             /* Offset of Events           */
  OS_U8 OS_TASK_EventMask_Offs;          /* Offset of EventMask        */
  OS_U8 OS_TASK_Name_Offs;               /* Offset of Name             */
  OS_U8 OS_TASK_StackSize_Offs;          /* Offset of StackSize        */
  OS_U8 OS_TASK_pStackBot_Offs;          /* Offset of pStackBot        */
  OS_U8 OS_TASK_NumActivations_Offs;     /* Offset of NumActivations   */
  OS_U8 OS_TASK_NumPreemptions_Offs;     /* Offset of NumPreemptions   */
  OS_U8 OS_TASK_ExecTotal_Offs;          /* Offset of ExecTotal        */
  OS_U8 OS_TASK_ExecLast_Offs;           /* Offset of ExecLast         */
  OS_U8 OS_TASK_Load_Offs;               /* Offset of Load             */
  OS_U8 OS_TASK_TimeSliceRem_Offs;       /* Offset of TimeSliceRem     */
  OS_U8 OS_TASK_TimeSliceReload_Offs;    /* Offset of TimeSliceReload  */
};

typedef struct OS_DEBUG_INFO_STRUCT OS_DEBUG_INFO;

/********************************************************************/

#ifdef __cplusplus
  }
#endif

#endif /* RTOS_H_INCLUDED */

/****** End Of File *************************************************/
